
# функция input

# документ PEP8

#операция ввода данных
# input() всегда возвращает строку
# in_1 = input("Введите первое число: ")
# in_2 = input("Введите второе число: ")

# result = in_1 + in_2 #конкатенация

# result = int(in_1) + int(in_2)  # int - integer

# print (result)



#Типы данных:
# целочисленные типы данных
# int_var = 777
# # числа с плавающей точкой
# float_var = 3.14
# # строковой тип данных
# str_var = "Hello, World!"
# # булевы типы данных (Джордж Буль)
# boolean_t = True
# boolean_f - False


# Способ форматирования строк - f-string (всего 5 способов, в т.ч. конкатенация)
name = "Varvara"
age = 25

s = f"Имя: {name} Возраст: {age}"
# print (s)


# Арифметические операции
x = 5
y = 7
res = x + y
res = x - y
res = x * y

x = 10
y = 5
res = x / y # всегда возвращает число с плавающей точкой

# целочисленное деление
res = x // y

#деление по остатку
x = 10
y = 7
res = x % y

#возведение в степень
res = x ** y

print (res)


